ci4/app/Controllers/Artikel.php

    public function admin_index()
    {
        $title = 'Daftar Artikel';
        $q = $this->request->getVar('q') ?? '';
        $model = new ArtikelModel();
        // $artikel = $model->findAll();
        $data = [
            'title'   => $title,
            'q'       => $q,
            'artikel' => $model->like('judul', $q)->paginate(3), #data dibatasi 4 record per halaman
---
SELECT *
FROM `artikel`
WHERE `judul` LIKE '%%' ESCAPE '!'
 LIMIT 3, 3
SELECT COUNT(*) AS `numrows`
FROM `artikel`
WHERE `judul` LIKE '%%' ESCAPE '!'

    public function add()
    {
        // validasi data.
        $validation = \Config\Services::validation();
        $validation->setRules(['judul' => 'required']);
        $isDataValid = $validation->withRequest($this->request)->run();
        if ($isDataValid) {
            $artikel = new ArtikelModel();
            $artikel->insert([
                'judul' => $this->request->getPost('judul'),
                'isi' => $this->request->getPost('isi'),
                'slug' => url_title($this->request->getVar('judul')),
            ]);
---
INSERT INTO `artikel` (`judul`, `isi`, `slug`) VALUES ('Artikel Keempat', 'Teknik Informatika merupakan jurusan yang mempelajari serta menerapkan prinsip-prinsip ilmu komputer, serta analisis matematis dalam perancangan, pengujian, pengembangan, evaluasi sistem operasi, perangkat lunak (Software), dan kinerja komputer.', 'Artikel-Keempat')

    public function edit($id)
    {
        $artikel = new ArtikelModel();
        // validasi data.
        $validation = \Config\Services::validation();
        $validation->setRules(['judul' => 'required']);

        $isDataValid = $validation->withRequest($this->request)->run();
        if ($isDataValid) {
            $artikel->update($id, [
                'judul' => $this->request->getPost('judul'),
                'isi' => $this->request->getPost('isi'),
            ]);
            return redirect('admin/artikel');
        }
        // ambil data lama
        $data = $artikel->where('id', $id)->first();
---
SELECT *
FROM `artikel`
WHERE `id` = '15'
 LIMIT 1